# Populating Database - Hakim Murphy

## Import Libraries

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import warnings
warnings.filterwarnings("ignore")

## Connect Database

In [2]:
DATABASE_URL = (
    "postgresql+psycopg2://neondb_owner:npg_CeS9fJg2azZD"
    "@ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech:5432/neondb"
    "?sslmode=require"
)

engine = create_engine(DATABASE_URL)

## Import Data

In [3]:
df=pd.read_csv('day_4_datasets/sat-results.csv')
df

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SAT Critical Readng Avg. Score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,355,218160,x345,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,383,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,377,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,414,427826,x123,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,390,672714,x123,92%,2.0
...,...,...,...,...,...,...,...,...,...,...,...
488,27Q480,JOHN ADAMS HIGH SCHOOL,403,391,409,392,391,863765,NaN,92%,1.0
489,13K605,GEORGE WESTINGHOUSE CAREER AND TECHNICAL EDUCA...,85,406,391,392,406,937579,x234,NaN,NaN
490,05M304,MOTT HALL HIGH SCHOOL,54,413,399,398,413,296405,x123,78%,2.0
491,02M520,MURRY BERGTRAUM HIGH SCHOOL FOR BUSINESS CAREERS,264,407,440,393,407,892839,NaN,92%,2.0
492,07X221,SOUTH BRONX PREPARATORY: A COLLEGE BOARD SCHOOL,65,364,378,348,364,277389,x345,92%,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 493 entries, 0 to 492
Data columns (total 11 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   DBN                              493 non-null    object
 1   SCHOOL NAME                      493 non-null    object
 2   Num of SAT Test Takers           493 non-null    object
 3   SAT Critical Reading Avg. Score  493 non-null    object
 4   SAT Math Avg. Score              493 non-null    object
 5   SAT Writing Avg. Score           493 non-null    object
 6   SAT Critical Readng Avg. Score   493 non-null    object
 7   internal_school_id               493 non-null    int64
 8   contact_extension                388 non-null    object
 9   pct_students_tested              376 non-null    object
 10  academic_tier_rating             402 non-null    float64
dtypes: float64(1), int64(1), object(9)
memory usage: 42.5+ KB

In [5]:
df.isnull().sum()

DBN                                  0
SCHOOL NAME                          0
Num of SAT Test Takers               0
SAT Critical Reading Avg. Score      0
SAT Math Avg. Score                  0
SAT Writing Avg. Score               0
SAT Critical Readng Avg. Score       0
internal_school_id                   0
contact_extension                  105
pct_students_tested                117
academic_tier_rating                91
dtype: int64

In [6]:
df.describe()

       internal_school_id  academic_tier_rating
count          493.000000            402.000000
mean        562172.943205              2.564677
std         262138.627055              1.126443
min         101855.000000              1.000000
25%         332013.000000              2.000000
50%         587220.000000              3.000000
75%         782993.000000              4.000000
max         999398.000000              4.000000

## Data Cleaning

### Drop duplicates

In [7]:
drop_duplicates_df = df.drop_duplicates().copy()
drop_duplicates_df

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SAT Critical Readng Avg. Score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,355,218160,x345,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,383,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,377,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,414,427826,x123,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,390,672714,x123,92%,2.0
...,...,...,...,...,...,...,...,...,...,...,...
473,75X012,P.S. X012 LEWIS AND CLARK SCHOOL,s,s,s,s,s,733698,x234,92%,1.0
474,75X754,J. M. RAPPORT SCHOOL CAREER DEVELOPMENT,s,s,s,s,s,976034,x345,NaN,4.0
475,79M645,SCHOOL FOR COOPERATIVE TECHNICAL EDUCATION,s,s,s,s,s,556924,x123,85%,1.0
476,79Q950,GED PLUS s CITYWIDE,8,496,400,426,496,544514,x234,92%,2.0
477,79X490,PHOENIX ACADEMY,9,367,370,360,367,248647,x234,85%,NaN

### Drop Unuseful Columns

In [8]:
drop_columns_df = drop_duplicates_df.drop(columns=['internal_school_id', 'contact_extension', 'SAT Critical Readng Avg. Score'])
drop_columns_df

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,92%,2.0
...,...,...,...,...,...,...,...,...
473,75X012,P.S. X012 LEWIS AND CLARK SCHOOL,s,s,s,s,92%,1.0
474,75X754,J. M. RAPPORT SCHOOL CAREER DEVELOPMENT,s,s,s,s,NaN,4.0
475,79M645,SCHOOL FOR COOPERATIVE TECHNICAL EDUCATION,s,s,s,s,85%,1.0
476,79Q950,GED PLUS s CITYWIDE,8,496,400,426,92%,2.0
477,79X490,PHOENIX ACADEMY,9,367,370,360,85%,NaN

### Fill NaN in pct_students_tested

Decided to use the mean and fill the missing information(NaN) with the sum of all values diveded by number of values.

In [9]:
mutated_column_df = drop_columns_df.copy()

s = (mutated_column_df['pct_students_tested']
       .astype(str).str.strip()
       .str.replace('%', '', regex=False)
)
s = pd.to_numeric(s, errors='coerce')

mean_val = s.mean()
mutated_column_df['pct_students_tested'] = (
    s.fillna(mean_val).round().astype('int64')
)

mutated_column_df

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,78,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,85,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,85,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,92,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,92,2.0
...,...,...,...,...,...,...,...,...
473,75X012,P.S. X012 LEWIS AND CLARK SCHOOL,s,s,s,s,92,1.0
474,75X754,J. M. RAPPORT SCHOOL CAREER DEVELOPMENT,s,s,s,s,85,4.0
475,79M645,SCHOOL FOR COOPERATIVE TECHNICAL EDUCATION,s,s,s,s,85,1.0
476,79Q950,GED PLUS s CITYWIDE,8,496,400,426,92,2.0
477,79X490,PHOENIX ACADEMY,9,367,370,360,85,NaN

### Change column names

Changed the column names to have a the same look.

In [10]:
mutated_column_df.columns = mutated_column_df.columns.str.lower().str.replace(' ', '_')

In [11]:
mutated_column_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 478 entries, 0 to 477
Data columns (total 8 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   dbn                              478 non-null    object
 1   school_name                      478 non-null    object
 2   num_of_sat_test_takers           478 non-null    object
 3   sat_critical_reading_avg._score  478 non-null    object
 4   sat_math_avg._score              478 non-null    object
 5   sat_writing_avg._score           478 non-null    object
 6   pct_students_tested              478 non-null    int64
 7   academic_tier_rating             392 non-null    float64
dtypes: float64(1), int64(1), object(6)
memory usage: 33.6+ KB

### Formatted columns

In [13]:
cols_to_int = [
    'num_of_sat_test_takers',
    'sat_critical_reading_avg._score',
    'sat_math_avg._score',
    'sat_writing_avg._score'
]

for col in cols_to_int:
    mutated_column_df[col] = (
        mutated_column_df[col]
        .replace(['s', 'S'], np.nan)
        .astype(float)
    )
    mean_val = mutated_column_df[col].mean()
    mutated_column_df[col] = mutated_column_df[col].fillna(mean_val).round().astype('int64')

mutated_column_df

,dbn,school_name,num_of_sat_test_takers,sat_critical_reading_avg._score,sat_math_avg._score,sat_writing_avg._score,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,78,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,85,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,85,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,92,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,92,2.0
...,...,...,...,...,...,...,...,...
473,75X012,P.S. X012 LEWIS AND CLARK SCHOOL,110,401,418,394,92,1.0
474,75X754,J. M. RAPPORT SCHOOL CAREER DEVELOPMENT,110,401,418,394,85,4.0
475,79M645,SCHOOL FOR COOPERATIVE TECHNICAL EDUCATION,110,401,418,394,85,1.0
476,79Q950,GED PLUS s CITYWIDE,8,496,400,426,92,2.0
477,79X490,PHOENIX ACADEMY,9,367,370,360,85,NaN

In [14]:
mutated_column_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 478 entries, 0 to 477
Data columns (total 8 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   dbn                              478 non-null    object
 1   school_name                      478 non-null    object
 2   num_of_sat_test_takers           478 non-null    int64
 3   sat_critical_reading_avg._score  478 non-null    int64
 4   sat_math_avg._score              478 non-null    int64
 5   sat_writing_avg._score           478 non-null    int64
 6   pct_students_tested              478 non-null    int64
 7   academic_tier_rating             392 non-null    float64
dtypes: float64(1), int64(5), object(2)
memory usage: 33.6+ KB

In [18]:
mutated_column_df.describe()

,num_of_sat_test_takers,sat_critical_reading_avg._score,sat_math_avg._score,sat_writing_avg._score,pct_students_tested,academic_tier_rating
count,478.000000,478.000000,478.00000,478.000000,478.000000,392.000000
mean,110.282427,400.868201,418.15272,393.987448,84.692469,2.579082
std,145.945805,53.300987,82.77245,55.020330,4.945360,1.128053
min,6.000000,279.000000,-10.00000,286.000000,78.000000,1.000000
25%,44.250000,370.000000,375.25000,363.000000,78.000000,2.000000
50%,68.000000,397.500000,403.00000,387.000000,85.000000,3.000000
75%,110.000000,411.750000,432.00000,403.000000,85.000000,4.000000
max,1277.000000,679.000000,1100.00000,682.000000,92.000000,4.000000

### Mutating columns with scores below 200 and above 800.

In [20]:
score_cols = [
    'sat_critical_reading_avg._score',
    'sat_math_avg._score',
    'sat_writing_avg._score'
]

for col in score_cols:
    mutated_column_df.loc[
        (mutated_column_df[col] < 200) | (mutated_column_df[col] > 800), col
    ] = np.nan
    mean_val = mutated_column_df[col].mean()
    mutated_column_df[col] = mutated_column_df[col].fillna(mean_val).round().astype('int64')

mutated_column_df

,dbn,school_name,num_of_sat_test_takers,sat_critical_reading_avg._score,sat_math_avg._score,sat_writing_avg._score,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,78,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,85,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,85,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,92,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,92,2.0
...,...,...,...,...,...,...,...,...
473,75X012,P.S. X012 LEWIS AND CLARK SCHOOL,110,401,418,394,92,1.0
474,75X754,J. M. RAPPORT SCHOOL CAREER DEVELOPMENT,110,401,418,394,85,4.0
475,79M645,SCHOOL FOR COOPERATIVE TECHNICAL EDUCATION,110,401,418,394,85,1.0
476,79Q950,GED PLUS s CITYWIDE,8,496,400,426,92,2.0
477,79X490,PHOENIX ACADEMY,9,367,370,360,85,NaN

In [ ]:
mutated_column_df.isnull().sum()

dbn                                 0
school_name                         0
num_of_sat_test_takers              0
sat_critical_reading_avg._score     0
sat_math_avg._score                 0
sat_writing_avg._score              0
pct_students_tested                 0
academic_tier_rating               86
dtype: int64

In [23]:
mutated_column_df['academic_tier_rating']

0      2.0
1      3.0
2      3.0
3      4.0
4      2.0
      ...
473    1.0
474    4.0
475    1.0
476    2.0
477    NaN
Name: academic_tier_rating, Length: 478, dtype: float64

### Fill NaN in 'academic_tier_rating' with mean

In [24]:
mutated_column_df['academic_tier_rating'] = (
    mutated_column_df['academic_tier_rating']
    .fillna(mutated_column_df['academic_tier_rating'].mean())
)

In [26]:
cleaned_df = mutated_column_df.copy()
cleaned_df

,dbn,school_name,num_of_sat_test_takers,sat_critical_reading_avg._score,sat_math_avg._score,sat_writing_avg._score,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,78,2.000000
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,85,3.000000
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,85,3.000000
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,92,4.000000
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,92,2.000000
...,...,...,...,...,...,...,...,...
473,75X012,P.S. X012 LEWIS AND CLARK SCHOOL,110,401,418,394,92,1.000000
474,75X754,J. M. RAPPORT SCHOOL CAREER DEVELOPMENT,110,401,418,394,85,4.000000
475,79M645,SCHOOL FOR COOPERATIVE TECHNICAL EDUCATION,110,401,418,394,85,1.000000
476,79Q950,GED PLUS s CITYWIDE,8,496,400,426,92,2.000000
477,79X490,PHOENIX ACADEMY,9,367,370,360,85,2.579082

In [27]:
cleaned_df.isnull().sum()

dbn                                0
school_name                        0
num_of_sat_test_takers             0
sat_critical_reading_avg._score    0
sat_math_avg._score                0
sat_writing_avg._score             0
pct_students_tested                0
academic_tier_rating               0
dtype: int64

## Export CSV

In [28]:
cleaned_df.to_csv('cleaned_sat_results.csv', index=False)

## Save to Database

In [29]:
cleaned_df.to_sql(
    name='hakim-murphy_sat_results',       
    con=engine,     
    schema='nyc_schools',
    if_exists='replace',    
    index=False            
)

478